import networkx as nx

def create_ukraine_graph():
    G_ukraine = nx.Graph()

    cities = ["Київ", "Харків", "Одеса", "Дніпро", "Львів", "Запоріжжя", "Миколаїв", "Івано-Франківськ", "Вінниця", "Полтава", "Ялта"]
    G_ukraine.add_nodes_from(cities)

    connections = [
        ("Київ", "Харків"), ("Київ", "Дніпро"), ("Київ", "Львів"), ("Харків", "Дніпро"), 
        ("Одеса", "Миколаїв"), ("Львів", "Івано-Франківськ"), ("Запоріжжя", "Дніпро"), 
        ("Одеса", "Київ"), ("Вінниця", "Київ"), ("Полтава", "Харків"), ("Ялта", "Одеса"),
        ("Вінниця", "Львів"), ("Вінниця", "Івано-Франківськ"), ("Вінниця", "Одеса"), 
        ("Одеса", "Миколаїв"), ("Полтава", "Київ"), ("Дніпро", "Миколаїв"), ("Миколаїв", "Запоріжжя")
    ]
    G_ukraine.add_edges_from(connections)

    return G_ukraine